app/representer/books_representer.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def author_name(book)
    "#{book.author.first_name} #{book.author.last_name}"