app/controllers/api/v1/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bookseller"], ["LIMIT", 1]]
---
      def user
        @user ||= User.find_by(username: params.require(:username))