app/controllers/api/v1/books_controller.rb

SELECT "books".* FROM "books"
---
      def index
        books = Book.limit(limit).offset(params[:offset])

INSERT INTO "authors" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Andy"], ["last_name", "Weir"], ["age", 48], ["created_at", "2023-01-04 11:11:54.630375"], ["updated_at", "2023-01-04 11:11:54.630375"]]
INSERT INTO "books" ("title", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?)  [["title", "ruby programming"], ["created_at", "2023-01-04 11:11:54.729681"], ["updated_at", "2023-01-04 11:11:54.729681"], ["author_id", 6]]
---
      def create
        # binding.irb
        author = Author.create!(author_params)
        book = Book.new(book_params.merge(author_id: author.id))
        if book.save

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def destroy
        Book.find(params[:id]).destroy!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
---
      def authenticate_user
         #Authorization: Bearer

         token, _options = token_and_options(request)
         user_id = AuthenticationTokenService.decode(token)
         User.find(user_id)