app/controllers/books_controller.rb

  def index
    render json: Book.all, status: :ok
---
SELECT "books".* FROM "books"

  def create
    book = Book.new(book_params)
    if book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Book name"], ["author", "James"], ["created_at", "2022-12-29 17:37:53.254282"], ["updated_at", "2022-12-29 17:37:53.254282"]]

  def destroy
    Book.find(params[:id]).destroy!
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 6]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]